{
  "backend/main.mo": "Motoko actor storing gift pages with create, query, list, and delete operations using a Map keyed by generated IDs.",
  "feature_evidence.json": "JSON report mapping high-level features to related frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global CSS defining light/dark OKLCH color variables and base styling.",
  "frontend/index.html": "HTML entry point loading the React app and setting metadata and favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for the creator page and gift unlock flow inside the app layout.",
  "frontend/src/components/gift-creator/GiftCreatorWizard.tsx": "Main multi‑step gift creation wizard managing form state, step rendering, and navigation.",
  "frontend/src/components/gift-creator/HiddenMessagesEditor.tsx": "Editor for adding, updating, and removing hidden surprise messages.",
  "frontend/src/components/gift-creator/QuizEditor.tsx": "Editor for managing quiz questions and answers with add, edit, and remove actions.",
  "frontend/src/components/gift-creator/steps/Step1Basics.tsx": "Collects basic gift info including names, email, and a date-password with validation.",
  "frontend/src/components/gift-creator/steps/Step2Images.tsx": "Handles uploading, processing, previewing, annotating, and removing banner and gallery photos.",
  "frontend/src/components/gift-creator/steps/Step3Content.tsx": "Provides tabbed editors for love message, ending message, quiz items, and hidden messages.",
  "frontend/src/components/gift-creator/steps/Step4Preview.tsx": "Shows a live preview of the final gift using all filled form sections and uploaded media.",
  "frontend/src/components/gift-creator/steps/Step5GenerateLink.tsx": "Creates the gift via API and displays a shareable link with copy and preview options.",
  "frontend/src/components/gift/EndingScreen.tsx": "Displays the final message with a fade‑in animation inside a styled card.",
  "frontend/src/components/gift/FloatingHearts.tsx": "Renders animated floating heart icons unless reduced‑motion is enabled.",
  "frontend/src/components/gift/GiftPage.tsx": "Builds the full gift page by decoding data, reconstructing images, and rendering all gift sections.",
  "frontend/src/components/gift/HeroBanner.tsx": "Shows the banner image with animated 'For' and 'From' overlay text and a heart icon.",
  "frontend/src/components/gift/HiddenMessages.tsx": "A component that reveals or hides surprise messages when clicking gift cards using a toggleable set of revealed indices.",
  "frontend/src/components/gift/LoveLetter.tsx": "Displays a love letter with a typewriter-style text reveal effect inside a styled card.",
  "frontend/src/components/gift/MemoryQuiz.tsx": "Renders a quiz with questions and toggleable answers, allowing users to reveal or hide each answer individually.",
  "frontend/src/components/gift/PasswordGate.tsx": "Provides a password entry form that validates an 8‑digit date and triggers an unlock callback on success.",
  "frontend/src/components/gift/PhotoFlipGallery.tsx": "Shows a grid of photos that flip to reveal notes on click using tracked flipped indices.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with background styling, gradient overlay, content wrapper, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useDocumentMeta.ts": "Hook for setting the document title and meta description when components mount or update.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading and managing identities with login and logout handling.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching and creating gift pages, including data encoding and media processing before submission.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom romantic theme colors, fonts, and animations including float, fade, and 3D flip card utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pages/GiftCreatorPage.tsx": "Renders the multi‑step gift creator wizard with page metadata and romantic header styling.",
  "frontend/src/pages/GiftUnlockPage.tsx": "Handles password‑gated gift access, loading states, error states, and renders the unlocked GiftPage with decoded data.",
  "frontend/src/types/gift.ts": "Defines TypeScript interfaces for gift form data, photos with notes, and quiz items.",
  "frontend/src/utils/clipboard.ts": "Provides a function to copy text to the clipboard with a secure-context check and fallback method.",
  "frontend/src/utils/giftDataEncoder.ts": "Implements JSON-based encoding and decoding of gift data for storage and retrieval.",
  "frontend/src/utils/imageProcessing.ts": "Resizes and compresses uploaded images using a canvas and returns a processed File object.",
  "frontend/src/utils/validation.ts": "Contains date and email validation helpers using simple regex and range checks.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, plugins, and support for okLCH theme variables.",
  "project_state.json": "Describes overall project requirements, existing features, architecture notes, and image asset needs."
}